#include "functions.h"


#include <iostream>

int main() {
    double x[6] = {0.15, 0.20, 0.25, 0.30, 0.40, 0.50};
    double y[6] = {4.48, 5.47, 6.05, 7.39, 8.11, 9.93};

    for (int n = 0; n < 4; ++n) {
        //--------------------------------------------------------------------------------
        for (int i = 0; i < 20; ++i) cout << "-";
        cout << endl;
        //--------------------------------------------------------------------------------
        cout << n << " степінь полінома: " << endl;
        double *res = dblAproximation(x, y, 6, n);
        cout << "\n P(x) = ";
        for (int i = 0; i <= n; ++i) {
            if (i == 0) {
                cout << setprecision(3) << res[i];
            } else {
                cout << setprecision(3) << " " << res[i] << "x^" << i;
            }
        }
        cout << endl;
        //--------------------------------------------------------------------------------
        for (int i = 0; i < 20; ++i) cout << "-";
        cout << endl;
        //--------------------------------------------------------------------------------
        delete res;
    }
    return 0;
}
